veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_reg.h
/** \brief 3D8, Kernel Reset Register 0 */
#define PSI5_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_KRST0*)0xF00053D8u)

/** \brief 3DC, Kernel Reset Register 1 */
#define PSI5_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_KRST1*)0xF00053DCu)

/** \brief 3E0, Kernel Reset Status Clear Register */
#define PSI5_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_KRSTCLR*)0xF00053E0u)

/** \brief 3E4, Receive FIFO Control Register 0 */
#define PSI5_RFC0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E4u)

/** \brief 3E8, Receive FIFO Control Register 1 */
#define PSI5_RFC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E8u)

/** \brief 3F8, Receive Data FIFO 0 */
#define PSI5_RDF0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDF*)0xF00053F8u)

/** \brief 3FC, Receive Data FIFO 1 */
#define PSI5_RDF1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDF*)0xF00053FCu)

/** \brief 40C, RSI Overview Register 0 */
#define PSI5_RSIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000540Cu)

/** \brief 410, RSI Overview Register 1 */
#define PSI5_RSIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005410u)

/** \brief 420, RMI Overview Register 0 */
#define PSI5_RMIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005420u)

/** \brief 424, RMI Overview Register 1 */
#define PSI5_RMIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005424u)

/** \brief 434, NBI Overview Register 0 */
#define PSI5_NBIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005434u)

/** \brief 438, NBI Overview Register 1 */
#define PSI5_NBIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005438u)

/** \brief 448, TEI Overview Register 0 */
#define PSI5_TEIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005448u)

/** \brief 44C, TEI Overview Register 1 */
#define PSI5_TEIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF000544Cu)

/** \brief 45C, CRCI Overview Register 0 */
#define PSI5_CRCIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF000545Cu)

/** \brief 460, CRCI Overview Register 1 */
#define PSI5_CRCIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005460u)

/** \brief 470, RDI Overview Register 0 */
#define PSI5_RDIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDIOV*)0xF0005470u)

/** \brief 474, RDI Overview Register 1 */
#define PSI5_RDIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDIOV*)0xF0005474u)

/** \brief 484, NFI Overview Register 0 */
#define PSI5_NFIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005484u)

/** \brief 488, NFI Overview Register 1 */
#define PSI5_NFIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005488u)

/** \brief 498, MEI Overview Register 0 */
#define PSI5_MEIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF0005498u)

/** \brief 49C, MEI Overview Register 1 */
#define PSI5_MEIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF000549Cu)

/** \brief 4AC, RSI Overview Set Register 0 */
#define PSI5_RSISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054ACu)

/** \brief 4B0, RSI Overview Set Register 1 */
#define PSI5_RSISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B0u)

/** \brief 4C0, RMI Overview Set Register 0 */
#define PSI5_RMISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C0u)

/** \brief 4C4, RMI Overview Set Register 1 */
#define PSI5_RMISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C4u)

/** \brief 4D4, NBI Overview Set Register 0 */
#define PSI5_NBISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D4u)

/** \brief 4D8, NBI Overview Set Register 1 */
#define PSI5_NBISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D8u)

/** \brief 4E8, TEI Overview Set Register 0 */
#define PSI5_TEISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054E8u)

/** \brief 4EC, TEI Overview Set Register 1 */
#define PSI5_TEISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054ECu)

/** \brief 4FC, CRCI Overview Set Register 0 */
#define PSI5_CRCISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF00054FCu)

/** \brief 500, CRCI Overview Set Register 1 */
#define PSI5_CRCISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005500u)

/** \brief 510, RDI Overview Set Register 0 */
#define PSI5_RDISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDISET*)0xF0005510u)

/** \brief 514, RDI Overview Set Register 1 */
#define PSI5_RDISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDISET*)0xF0005514u)

/** \brief 524, NFI Overview Set Register 0 */
#define PSI5_NFISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005524u)

/** \brief 528, NFI Overview Set Register 1 */
#define PSI5_NFISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005528u)

/** \brief 538, MEI Overview Set Register 0 */
#define PSI5_MEISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005538u)

/** \brief 53C, MEI Overview Set Register 1 */
#define PSI5_MEISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEISET*)0xF000553Cu)

/** \brief 54C, RSI Overview Clear Register 0 */
#define PSI5_RSICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000554Cu)

/** \brief 550, RSI Overview Clear Register 1 */
#define PSI5_RSICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005550u)

/** \brief 560, RMI Overview Clear Register 0 */
#define PSI5_RMICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005560u)

/** \brief 564, RMI Overview Clear Register 1 */
#define PSI5_RMICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005564u)

/** \brief 574, NBI Overview Clear Register 0 */
#define PSI5_NBICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005574u)

/** \brief 578, NBI Overview Clear Register 1 */
#define PSI5_NBICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005578u)

/** \brief 588, TEI Overview Clear Register 0 */
#define PSI5_TEICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005588u)

/** \brief 58C, TEI Overview Clear Register 1 */
#define PSI5_TEICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF000558Cu)

/** \brief 59C, CRCI Overview Clear Register 0 */
#define PSI5_CRCICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF000559Cu)

/** \brief 5A0, CRCI Overview Clear Register 1 */
#define PSI5_CRCICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A0u)

/** \brief 5B0, RDI Overview Clear Register 0 */
#define PSI5_RDICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B0u)

/** \brief 5B4, RDI Overview Clear Register 1 */
#define PSI5_RDICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B4u)

/** \brief 5C4, NFI Overview Clear Register 0 */
#define PSI5_NFICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C4u)

/** \brief 5C8, NFI Overview Clear Register 1 */
#define PSI5_NFICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C8u)

/** \brief 5D8, MEI Overview Clear Register 0 */
#define PSI5_MEICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055D8u)

