veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_reg.h
/** \brief 990, Receive Data Memory Low 318 */
#define PSI5_RDM3_18_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005990u)
/** Alias (User Manual Name) for PSI5_RDM3_18_L.
* To use register names with standard convension, please use PSI5_RDM3_18_L.
*/
#define PSI5_RDML318 (PSI5_RDM3_18_L)

/** \brief 994, Receive Data Memory High 318 */
#define PSI5_RDM3_18_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005994u)
/** Alias (User Manual Name) for PSI5_RDM3_18_H.
* To use register names with standard convension, please use PSI5_RDM3_18_H.
*/
#define PSI5_RDMH318 (PSI5_RDM3_18_H)

/** \brief 998, Receive Data Memory Low 319 */
#define PSI5_RDM3_19_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005998u)
/** Alias (User Manual Name) for PSI5_RDM3_19_L.
* To use register names with standard convension, please use PSI5_RDM3_19_L.
*/
#define PSI5_RDML319 (PSI5_RDM3_19_L)

/** \brief 99C, Receive Data Memory High 319 */
#define PSI5_RDM3_19_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000599Cu)
/** Alias (User Manual Name) for PSI5_RDM3_19_H.
* To use register names with standard convension, please use PSI5_RDM3_19_H.
*/
#define PSI5_RDMH319 (PSI5_RDM3_19_H)

/** \brief 9A0, Receive Data Memory Low 320 */
#define PSI5_RDM3_20_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059A0u)
/** Alias (User Manual Name) for PSI5_RDM3_20_L.
* To use register names with standard convension, please use PSI5_RDM3_20_L.
*/
#define PSI5_RDML320 (PSI5_RDM3_20_L)

/** \brief 9A4, Receive Data Memory High 320 */
#define PSI5_RDM3_20_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059A4u)
/** Alias (User Manual Name) for PSI5_RDM3_20_H.
* To use register names with standard convension, please use PSI5_RDM3_20_H.
*/
#define PSI5_RDMH320 (PSI5_RDM3_20_H)

/** \brief 9A8, Receive Data Memory Low 321 */
#define PSI5_RDM3_21_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059A8u)
/** Alias (User Manual Name) for PSI5_RDM3_21_L.
* To use register names with standard convension, please use PSI5_RDM3_21_L.
*/
#define PSI5_RDML321 (PSI5_RDM3_21_L)

/** \brief 9AC, Receive Data Memory High 321 */
#define PSI5_RDM3_21_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059ACu)
/** Alias (User Manual Name) for PSI5_RDM3_21_H.
* To use register names with standard convension, please use PSI5_RDM3_21_H.
*/
#define PSI5_RDMH321 (PSI5_RDM3_21_H)

/** \brief 9B0, Receive Data Memory Low 322 */
#define PSI5_RDM3_22_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059B0u)
/** Alias (User Manual Name) for PSI5_RDM3_22_L.
* To use register names with standard convension, please use PSI5_RDM3_22_L.
*/
#define PSI5_RDML322 (PSI5_RDM3_22_L)

/** \brief 9B4, Receive Data Memory High 322 */
#define PSI5_RDM3_22_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059B4u)
/** Alias (User Manual Name) for PSI5_RDM3_22_H.
* To use register names with standard convension, please use PSI5_RDM3_22_H.
*/
#define PSI5_RDMH322 (PSI5_RDM3_22_H)

/** \brief 9B8, Receive Data Memory Low 323 */
#define PSI5_RDM3_23_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059B8u)
/** Alias (User Manual Name) for PSI5_RDM3_23_L.
* To use register names with standard convension, please use PSI5_RDM3_23_L.
*/
#define PSI5_RDML323 (PSI5_RDM3_23_L)

/** \brief 9BC, Receive Data Memory High 323 */
#define PSI5_RDM3_23_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059BCu)
/** Alias (User Manual Name) for PSI5_RDM3_23_H.
* To use register names with standard convension, please use PSI5_RDM3_23_H.
*/
#define PSI5_RDMH323 (PSI5_RDM3_23_H)

/** \brief 9C0, Receive Data Memory Low 324 */
#define PSI5_RDM3_24_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059C0u)
/** Alias (User Manual Name) for PSI5_RDM3_24_L.
* To use register names with standard convension, please use PSI5_RDM3_24_L.
*/
#define PSI5_RDML324 (PSI5_RDM3_24_L)

/** \brief 9C4, Receive Data Memory High 324 */
#define PSI5_RDM3_24_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059C4u)
/** Alias (User Manual Name) for PSI5_RDM3_24_H.
* To use register names with standard convension, please use PSI5_RDM3_24_H.
*/
#define PSI5_RDMH324 (PSI5_RDM3_24_H)

/** \brief 9C8, Receive Data Memory Low 325 */
#define PSI5_RDM3_25_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059C8u)
/** Alias (User Manual Name) for PSI5_RDM3_25_L.
* To use register names with standard convension, please use PSI5_RDM3_25_L.
*/
#define PSI5_RDML325 (PSI5_RDM3_25_L)

/** \brief 9CC, Receive Data Memory High 325 */
#define PSI5_RDM3_25_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059CCu)
/** Alias (User Manual Name) for PSI5_RDM3_25_H.
* To use register names with standard convension, please use PSI5_RDM3_25_H.
*/
#define PSI5_RDMH325 (PSI5_RDM3_25_H)

/** \brief 9D0, Receive Data Memory Low 326 */
#define PSI5_RDM3_26_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059D0u)
/** Alias (User Manual Name) for PSI5_RDM3_26_L.
* To use register names with standard convension, please use PSI5_RDM3_26_L.
*/
#define PSI5_RDML326 (PSI5_RDM3_26_L)

/** \brief 9D4, Receive Data Memory High 326 */
#define PSI5_RDM3_26_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059D4u)
/** Alias (User Manual Name) for PSI5_RDM3_26_H.
* To use register names with standard convension, please use PSI5_RDM3_26_H.
*/
#define PSI5_RDMH326 (PSI5_RDM3_26_H)

/** \brief 9D8, Receive Data Memory Low 327 */
#define PSI5_RDM3_27_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059D8u)
/** Alias (User Manual Name) for PSI5_RDM3_27_L.
* To use register names with standard convension, please use PSI5_RDM3_27_L.
*/
#define PSI5_RDML327 (PSI5_RDM3_27_L)

/** \brief 9DC, Receive Data Memory High 327 */
#define PSI5_RDM3_27_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059DCu)
/** Alias (User Manual Name) for PSI5_RDM3_27_H.
* To use register names with standard convension, please use PSI5_RDM3_27_H.
*/
#define PSI5_RDMH327 (PSI5_RDM3_27_H)

